app/controllers/posts_controller.rb

	def create
	  @post = Post.new ## saved new post into an instance
	  @post.title = params[:title] ## used instance and assigned a title it took in thru the form
	  @post.description = params[:description]
	  @post.save ## saved instance with new params
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]